---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.DisparityResponse
source: html/29ab805b-5976-912d-3166-ef04d78d612f.htm
---
# Autodesk.Revit.DB.ExternalService.DisparityResponse

An enumerated value to return from OnServerDiparity indicating
 what the service wants Revit to do as the post-action of the call.

## Syntax (C#)
```csharp
public enum DisparityResponse
```